app/controllers/api/exercises_controller.rb

INSERT INTO `exercises` (`student_id`, `pre_work_id`, `created_at`, `updated_at`) VALUES (1, 1, '2016-04-03 10:33:48', '2016-04-03 10:33:48')
SELECT  `exercises`.* FROM `exercises` WHERE `exercises`.`student_id` = 1 AND `exercises`.`pre_work_id` = 1  ORDER BY `exercises`.`id` ASC LIMIT 1
UPDATE `exercises` SET `url` = 'url1', `completed` = 0, `updated_at` = '2016-04-03 10:35:32' WHERE `exercises`.`id` = 1
---
  def create
    puts '====================='
    puts '====================='
    puts current_student.inspect
    puts '====================='
    puts '====================='

    exercise = current_student.exercises.where(:pre_work_id => params[:pre_work_id]).first_or_create
    exercise.update_attributes({:url => params[:url], :completed => params[:completed]})