app/controllers/api/students_controller.rb

  def progress
    completed = @student.exercises.where(:completed => true).count
---
SELECT COUNT(*) FROM `exercises` WHERE `exercises`.`student_id` = 1 AND `exercises`.`completed` = 1